nagyjose/DP/Zavodnik_Syst/STM32CubeIDE/Application/User/STM32_WPAN/app/flash_logger.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
 * @file    flash_logger.c
 * @author  Josef Nagy
 * @brief
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 Josef Nagy.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

#include "flash_logger.h"
#include "dbg_trace.h"
#include "app_conf.h"
#include "app_common.h"
#include <stdbool.h>
#include "stm32wbxx_hal.h"

// ===== Defines ==========================================================================
// ===== Global variables =================================================================

// Globální proměnné pro rychlý zápis z RAM
static uint32_t current_flash_ptr = LOGGER_START_ADDR;
static uint16_t current_punch_index = 0;
bool is_race_closed = false;

// ===== External variables ===============================================================
// ===== External functions ===============================================================

extern IWDG_HandleTypeDef hiwdg; // Potřebujeme sáhnout na psa v main.c

// ===== Function declaration =============================================================
// ===== Function definition ==============================================================


// Výpočet CRC-32 (Standardní IEEE 802.3 polynom)
static uint32_t Calculate_CRC32(uint8_t *data, uint32_t length)
{
    uint32_t crc = 0xFFFFFFFF;
    for (uint32_t i = 0; i < length; i++) {
        crc ^= data[i];
        for (uint8_t j = 0; j < 8; j++) {
            if (crc & 1) crc = (crc >> 1) ^ 0xEDB88320;
            else crc >>= 1;
        }
    }
    return crc ^ 0xFFFFFFFF;
}

// Interní pomocná funkce pro smazání 4KB stránky
static void ErasePage(uint32_t page_address)
{
	FLASH_EraseInitTypeDef EraseInitStruct;
	uint32_t PageError;

	// Výpočet čísla stránky z adresy
	uint32_t page_index = (page_address - 0x08000000) / 4096;

	APP_DBG("--- FLASH: MAZANI STRANKY 0x%08X (Cislo: %lu) ---", page_address, page_index);

	EraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
	// Výpočet čísla stránky z adresy (0x08000000 je start, stránka má 4096 B)
	EraseInitStruct.Page = (page_address - 0x08000000) / 4096;
	EraseInitStruct.NbPages = 1;

	HAL_FLASH_Unlock();
	__HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR | FLASH_FLAG_EOP | FLASH_FLAG_WRPERR | FLASH_FLAG_PGSERR);
	HAL_FLASHEx_Erase(&EraseInitStruct, &PageError);
	HAL_FLASH_Lock();
}

// Inicializace při bootu (Hledání ztraceného pointeru)
void Logger_Init(void)
{
	uint32_t active_page_addr = LOGGER_START_ADDR;
	uint8_t found = 0;

	// Skenujeme první záznam na každé z 159 stránek
	for (int i = 0; i < LOGGER_MAX_PAGES; i++)
	{
		uint32_t page_addr = LOGGER_START_ADDR + (i * LOGGER_PAGE_SIZE);
		uint32_t next_page_addr = LOGGER_START_ADDR + (((i + 1) % LOGGER_MAX_PAGES) * LOGGER_PAGE_SIZE);

		uint64_t current_page_head = *(volatile uint64_t*)page_addr;
		uint64_t next_page_head = *(volatile uint64_t*)next_page_addr;

		// Nalezena stránka, která má data, ale stránka za ní je smazaná (samé 1).
		// -> Aktivní závod
		if (current_page_head != 0xFFFFFFFFFFFFFFFF && next_page_head == 0xFFFFFFFFFFFFFFFF)
		{
			active_page_addr = page_addr;
			found = 1;
			break;
		}
	}

	// Pokud je paměť úplně prázdná (první zapnutí)
	if (!found) {
		ErasePage(active_page_addr);
	}

	// Nyní najdeme první prázdné místo uvnitř aktivní stránky
	current_flash_ptr = active_page_addr;
	current_punch_index = 0;

	while (*(volatile uint64_t*)current_flash_ptr != 0xFFFFFFFFFFFFFFFF)
	{
		// Kontrola, zda tento záznam není CÍL
		uint8_t *raw = (uint8_t*)current_flash_ptr;
		uint16_t cid = (raw[0] << 4) | (raw[1] >> 4);
		if (cid == FINISH_CONTROL_ID) {
			is_race_closed = true;
		}

		current_punch_index++;
		current_flash_ptr += 8;

		// Bezpečnostní pojistka proti přetečení stránky
		if (current_punch_index >= LOGGER_MAX_RECORDS_PP) break;
	}

	APP_DBG("LOGGER INIT: Aktivni stranka: 0x%08X, Zaznamu: %d", active_page_addr, current_punch_index);
}

// Oražení kontroly (Bleskový zápis)
void Logger_SavePunch(uint8_t* raw_payload, uint8_t rssi_abs, int8_t temperature)
{
	// Vyčteme si ID kontroly ze syrových dat
	uint16_t control_id = (raw_payload[0] << 4) | (raw_payload[1] >> 4);

	// Pojistka pro cíl (Rezervace pozice 512)
	// Pokud nám zbývá poslední místo na stránce (index 511) a NENÍ to Cíl...
	if (current_punch_index == (LOGGER_MAX_RECORDS_PP - 1) && control_id != FINISH_CONTROL_ID) {
		APP_DBG("LOGGER WARNING: Stranka plna, rezervovano vyhradne pro CIL!");
		return;
	}

	// Standardní ochrana proti přetečení
	if (current_punch_index >= LOGGER_MAX_RECORDS_PP) {
		APP_DBG("LOGGER ERROR: Stranka je plna!");
		return;
	}

	uint32_t saved_addr = current_flash_ptr;
	PunchRecord_t record;

	// Rychlé zkopírování 6 bajtů surových dat
	for(int i = 0; i < 6; i++) {
		record.data.raw_payload[i] = raw_payload[i];
	}

	record.data.rssi = rssi_abs;
	record.data.temperature = temperature;

	// Uzamčení závodu po oražení Cíle
	if (control_id == FINISH_CONTROL_ID) {
		is_race_closed = true;
	}

	HAL_FLASH_Unlock();
	__HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR | FLASH_FLAG_EOP | FLASH_FLAG_WRPERR | FLASH_FLAG_PGSERR);
	HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, current_flash_ptr, record.double_word);
	HAL_FLASH_Lock();

	current_flash_ptr += 8;
	current_punch_index++;

	// Rozbalení pouze pro výpis do logu
	// uint16_t control_id = (raw_payload[0] << 4) | (raw_payload[1] >> 4);
	uint8_t sub_seconds = raw_payload[1] & 0x0F;
	uint32_t unix_time = ((uint32_t)raw_payload[2] << 24) | ((uint32_t)raw_payload[3] << 16) |
											 ((uint32_t)raw_payload[4] << 8) | (uint32_t)raw_payload[5];

	APP_DBG("LOG ULOZEN -> Adr: 0x%08X | Ctrl_ID: %d | Cas: %lu.%d s | RSSI: -%d dBm | Teplota: %d C",
					 saved_addr, control_id, unix_time, sub_seconds, rssi_abs, temperature);
}

// Clear kontrola (Nulování a přesun na další stránku)
void Logger_NewRace(uint8_t* raw_clear_payload)
{
	is_race_closed = false; // Odemknutí nového závodu

	//uint32_t current_page_offset = current_flash_ptr - LOGGER_START_ADDR;
	//uint32_t current_page_index = current_page_offset / LOGGER_PAGE_SIZE;
	//uint32_t current_page_addr = LOGGER_START_ADDR + (current_page_index * LOGGER_PAGE_SIZE);

	uint32_t current_page_addr = current_flash_ptr - (current_punch_index * 8);
	uint32_t current_page_index = (current_page_addr - LOGGER_START_ADDR) / LOGGER_PAGE_SIZE;

	// Inteligentní clear (záchrana paměti)
	if (current_punch_index == 0)
	{
		// Stránka je prázdná, rovnou zapíšeme první záznam
		Logger_SavePunch(raw_clear_payload, 0, 20);
		APP_DBG(">>> INTELIGENTNI CLEAR! Prvni zapis na cistou stranku.");
	}
	else if (current_punch_index == 1)
	{
		// Na stránce je přesně jeden záznam (z předchozího CLEAR).
		// Jdeme ho přečíst přímo z Flash paměti (6 bajtů payloadu).
		uint8_t* saved_payload = (uint8_t*)current_page_addr;

		bool is_identical = true;
		for(int i = 0; i < 6; i++) {
			if (saved_payload[i] != raw_clear_payload[i]) {
				is_identical = false;
				break;
			}
		}

		if (is_identical)
		{
			// Záznam je totožný s tím, co tam leží. Neděláme nic
			APP_DBG(">>> INTELIGENTNI CLEAR! Zaznam je shodny, setrim pamet (nic nemazu).");
			return;
		}
		else
		{
			// Záznam je odlišný (závodník přešel k JINÉ CLEAR kontrole). Přemažeme.
			APP_DBG(">>> INTELIGENTNI CLEAR! Zaznam odlisny. Premazavam stranku %lu", current_page_index);
			current_flash_ptr = current_page_addr;
			current_punch_index = 0;
			ErasePage(current_page_addr);
			Logger_SavePunch(raw_clear_payload, 0, 20);
		}
	}
	else
	{
		// Standardní clear (Máme už záznamy ze závodu, posouváme se na N+1)
		uint32_t next_page_index = (current_page_index + 1) % LOGGER_MAX_PAGES;
		uint32_t next_page_addr = LOGGER_START_ADDR + (next_page_index * LOGGER_PAGE_SIZE);

		uint32_t barrier_page_index = (next_page_index + 1) % LOGGER_MAX_PAGES;
		uint32_t barrier_page_addr = LOGGER_START_ADDR + (barrier_page_index * LOGGER_PAGE_SIZE);

		ErasePage(barrier_page_addr); // N+2 bariéra

		current_flash_ptr = next_page_addr;
		current_punch_index = 0;

		APP_DBG(">>> NOVY ZAVOD START! Presun na stranku: %lu (Adresa: 0x%08X)", next_page_index, next_page_addr);
		Logger_SavePunch(raw_clear_payload, 0, 20); // Zápis na N+1
	}
}

// Pomocná funkce pro smazání nulté konfigurační stránky (strana 32)
static void EraseConfigPage(void)
{
	FLASH_EraseInitTypeDef EraseInitStruct;
	uint32_t PageError;

	// 0x08020000 je přesně 32. stránka (128 KB od začátku paměti 0x08000000)
	EraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
	EraseInitStruct.Page = 32;
	EraseInitStruct.NbPages = 1;

	HAL_FLASH_Unlock();
	__HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR | FLASH_FLAG_EOP | FLASH_FLAG_WRPERR | FLASH_FLAG_PGSERR);
	HAL_FLASHEx_Erase(&EraseInitStruct, &PageError);
	HAL_FLASH_Lock();
}


// Tovární nastavení a zápis do flash
static void Config_FactoryReset(void)
{
	APP_DBG("CONFIG: Vytvarim tovarni nastaveni...");

	// Vytvoříme prázdnou strukturu v RAM a vynulujeme ji
	RunnerConfig_t def_cfg;
	memset(&def_cfg, 0, sizeof(RunnerConfig_t));

	// Naplnění výchozími hodnotami
	def_cfg.magic_word = 0xCAFECAFE;
	strcpy(def_cfg.hw_revision, "Rev 1.0 ZAVODNIK");
	// fw_version se doplní dynamicky v main.c pomocí extern Gitu

	// Vysílané informace
	def_cfg.comp_device_type = 0x00;       // Standardní závodník
	def_cfg.comp_device_id = 999999;       // Výchozí ID
	def_cfg.comp_device_hash = 123456;     // Výchozí PIN pro BLE

	// Rozhodovací parametry
	def_cfg.cooldown_ms = 4000;            // 4 vteřiny
	def_cfg.required_hits = 3;             // 3 hity
	def_cfg.num_hits = 5;                  // Z 5 paketů
	def_cfg.buzzer_onoff = 1;              // Pípání povoleno

	// Texty
	strcpy(def_cfg.comp_name, "Neznamy Zavodnik");
	strcpy(def_cfg.comp_nationality, "CZE");

	// Výpočet CRC-32
	def_cfg.control_sum = 0; // Před výpočtem musíme pole vynulovat
	def_cfg.control_sum = Calculate_CRC32((uint8_t*)&def_cfg, sizeof(RunnerConfig_t));

	// Zápis do flash paměti
	EraseConfigPage(); // Smažeme starý odpad

	// Budeme data čist jako pole obyčejných bajtů (bezpečné pro packed struktury)
	uint8_t *data_ptr = (uint8_t*)&def_cfg;
	uint32_t flash_ptr = CONFIG_FLASH_ADDR;

	// Zápis probíhá striktně po 8 bajtech (Double Word)
	uint32_t double_words_count = sizeof(RunnerConfig_t) / 8;

	HAL_FLASH_Unlock();
	__HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR | FLASH_FLAG_EOP | FLASH_FLAG_WRPERR | FLASH_FLAG_PGSERR);

	for (uint32_t i = 0; i < double_words_count; i++)
	{
		uint64_t double_word_to_write = 0;

		// Zkopírujeme 8 bajtů ze struktury do našeho 64bitového čísla pro zápis
		memcpy(&double_word_to_write, data_ptr + (i * 8), 8);

		HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, flash_ptr, double_word_to_write);
		flash_ptr += 8;
	}

	HAL_FLASH_Lock();
	APP_DBG("CONFIG: Tovarni nastaveni uspesne zapsano!");
}

// Hlavní inicializace a záchranný reset (Voláno z main.c)
void Config_Init(void)
{
	// 1. Záchranná brzda: Kontrola tlačítka SW3 při startu desky (poue vývojová varianta)
	// Tlačítko je Active-Low (Při stisku vrací 0, v klidu 1)
	if (BSP_PB_GetState(BUTTON_SW3) == 0)
	{
		// Krátká prodleva pro odfiltrování zákmitů
		HAL_Delay(50);

		// Pokud je i po 50 ms stále stisknuto, myslí to uživatel vážně
		if (BSP_PB_GetState(BUTTON_SW3) == 0)
		{
			uint8_t hold_time = 0;

			// Cyklus běží pouze dokud uživatel fyzicky drží tlačítko
			while(BSP_PB_GetState(BUTTON_SW3) == 0) {
				HAL_Delay(100);
				hold_time++;

				// Watchdog doplnění
				HAL_IWDG_Refresh(&hiwdg);

				if(hold_time > 30) { // 30 * 100ms = 3 vteřiny
					APP_DBG(">>> SECURITY: DETEKOVAN ZACHRANNY RESET TLACITKEM! <<<");
					Config_FactoryReset(); // Smaže konfiguraci a vrátí PIN na 123456

					// Zablikáme pro potvrzení úspěchu
					for(int i=0; i<10; i++) { BSP_LED_Toggle(LED_RED); HAL_Delay(50); }
					BSP_LED_Off(LED_RED);
					break; // Vyskočíme z cyklu
				}
			}
		}
	}

	// 2. Kontrola integrity paměti (Magic Word + CRC-32)
	// Zkopírujeme si obsah Flash do RAM, abychom s ním mohli pracovat
	RunnerConfig_t temp_cfg;
	memcpy(&temp_cfg, (void*)DEVICE_CONFIG, sizeof(RunnerConfig_t));

	// Uložíme si přečtené CRC a pole pro výpočet vynulujeme
	uint32_t saved_crc = temp_cfg.control_sum;
	temp_cfg.control_sum = 0;

	// Spočítáme kontrolní součet z dat
	uint32_t calculated_crc = Calculate_CRC32((uint8_t*)&temp_cfg, sizeof(RunnerConfig_t));

	// Pokud nesedí magické slovo NEBO nesedí CRC, paměť je zničená/prázdná
	if (DEVICE_CONFIG->magic_word != 0xCAFECAFE || saved_crc != calculated_crc)
	{
			APP_DBG("CONFIG: Pamet neznama nebo poskozena! (CRC: Ocekavano %08X, Precteno %08X)", calculated_crc, saved_crc);
			Config_FactoryReset();
	}
	else
	{
			APP_DBG("CONFIG: Nacteno OK. Zavodnik: %s (ID: %lu)",
											 DEVICE_CONFIG->comp_name, DEVICE_CONFIG->comp_device_id);
	}
}

// Příprava dat pro tunel
void Logger_GetDownloadData(uint8_t cmd, uint8_t param, uint8_t **start_ptr, uint32_t *len)
{
	if (cmd == 0x20) {
		// --- CMD_DOWNLOAD_CURRENT (Jen aktuální závod) ---
		// current_flash_ptr ukazuje na PRVNÍ VOLNÉ MÍSTO.
		// Začátek závodu získáme odečtením délky všech zatím zapsaných záznamů.
		*start_ptr = (uint8_t*)(current_flash_ptr - (current_punch_index * 8));
		*len = current_punch_index * 8; // Pošleme jen platné záznamy

		// Pojistka: Pokud jsme na úplném začátku nové stránky (Cíl byl 512. záznam)
		if (*len == 0 && current_flash_ptr > LOGGER_START_ADDR) {
			*start_ptr = (uint8_t*)(current_flash_ptr - LOGGER_PAGE_SIZE);
			*len = LOGGER_PAGE_SIZE;
		}
	}
	else if (cmd == 0x21) {
		// --- CMD_DOWNLOAD_ALL (Kompletní výpis všeho) ---

		// Pokud je paměť úplně prázdná
		if (current_flash_ptr == LOGGER_START_ADDR && current_punch_index == 0) {
				*start_ptr = NULL;
				*len = 0;
				return;
		}

		// Protože je paměť naformátována (a 640 KB je obrovský prostor),
		// všechna  data leží bezpečně a souvisle od začátku paměti
		// až po aktuální ukazatel zápisu.
		*start_ptr = (uint8_t*)LOGGER_START_ADDR;
		*len = current_flash_ptr - LOGGER_START_ADDR;
	}
	else if (cmd == 0x22) {
		// --- CMD_DOWNLOAD_SPECIFIC (N závodů do historie) ---
		if (param == 0) param = 1; // Pojistka: param=1 znamená předchozí závod

		uint32_t search_ptr = current_flash_ptr;
		uint32_t end_of_target = 0;
		uint32_t start_of_target = 0;
		uint8_t clears_found = 0;

		// Pokud je paměť úplně prázdná
		if (current_flash_ptr == LOGGER_START_ADDR && current_punch_index == 0) {
			*start_ptr = NULL; *len = 0; return;
		}

		// Hledáme pozpátku jako buldok
		while (1) {
			// Posun vzad s ošetřením kruhového přetečení na konec paměti
			if (search_ptr <= LOGGER_START_ADDR) {
				search_ptr = LOGGER_START_ADDR + (LOGGER_MAX_PAGES * LOGGER_PAGE_SIZE);
			}
			search_ptr -= 8;

			// Obešli jsme celou paměť až k našemu výchozímu bodu
			if (search_ptr == current_flash_ptr) break;

			uint64_t val = *(volatile uint64_t*)search_ptr;

			// Pokud narazíme na prázdné místo mezi stránkami,
			// nesmíme to ukončit! Jen ho v klidu přeskočíme a hledáme dál.
			if (val == 0xFFFFFFFFFFFFFFFF) {
				continue;
			}

			// Přečteme ID kontroly
			uint8_t *raw = (uint8_t*)search_ptr;
			uint16_t cid = (raw[0] << 4) | (raw[1] >> 4);

			// Narazili jsme na oddělovač závodů
			if (cid == CLEAR_CONTROL_ID) {
				clears_found++;

				if (clears_found == param) {
					// Našli jsme CLEAR novějšího závodu. Zde náš historický závod končí.
					end_of_target = search_ptr;
				}
				else if (clears_found == param + 1) {
					// Našli jsme CLEAR našeho historického závodu. Tady začíná!
					start_of_target = search_ptr;
					break;
				}
			}
		}

		// Vyhodnocení a předání kráječi
		// Pokud jsme nenašli dostatek CLEARů (uživatel chce víc historie, než máme)
		if (clears_found < (param + 1)) {
			*start_ptr = NULL;
			*len = 0;
			return;
		}

		*start_ptr = (uint8_t*)start_of_target;

		// Přesný výpočet délky bez prázdné vaty (0xFF)
		uint32_t exact_len = 0;
		uint32_t read_ptr = start_of_target;

		// Půjdeme od začátku závodu dopředu, dokud nenarazíme na další závod (end_of_target)
		// nebo dokud nenarazíme na prázdnou paměť (0xFFFFFFFFFFFFFFFF).
		while (read_ptr != end_of_target) {
			uint64_t val = *(volatile uint64_t*)read_ptr;

			// Tady závod reálně končí, zbytek stránky je už jen prázdná vata
			if (val == 0xFFFFFFFFFFFFFFFF) {
				break;
			}

			exact_len += 8;

			// Kruhový posun dopředu
			read_ptr += 8;
			if (read_ptr >= LOGGER_START_ADDR + (LOGGER_MAX_PAGES * LOGGER_PAGE_SIZE)) {
				read_ptr = LOGGER_START_ADDR;
			}
		}

		*len = exact_len;
	}
	else {
		// Neznámý příkaz
		*start_ptr = NULL;
		*len = 0;
	}
}

// Formátování celé paměti (Příkaz z BLE)
void Logger_FormatAll(void)
{
	APP_DBG("--- FORMATOVANI CELE PAMETI (159 stranek) ZACAHA... ---");

	for (int i = 0; i < LOGGER_MAX_PAGES; i++) {
		uint32_t page_addr = LOGGER_START_ADDR + (i * LOGGER_PAGE_SIZE);
		ErasePage(page_addr);

		// atchdog refresh
		HAL_IWDG_Refresh(&hiwdg);
	}

	// Reset ukazatelů na úplný začátek
	current_flash_ptr = LOGGER_START_ADDR;
	current_punch_index = 0;

	APP_DBG("--- FORMATOVANI DOKONCENO, PAMET JE CISTA ---");
}

// Hromadný zápis konfigurace (commit z RAM)
void Config_Commit(RunnerConfig_t *new_cfg)
{
	// Výpočet CRC-32 před zápisem
	new_cfg->control_sum = 0; // Vynulujeme starý součet
	new_cfg->control_sum = Calculate_CRC32((uint8_t*)new_cfg, sizeof(RunnerConfig_t));

	// 1. Smažeme celou konfigurační stránku ve Flash
	EraseConfigPage();

	// 2. Projdeme celou strukturu z RAM a zapíšeme ji po 8 bajtech
	uint8_t *data_ptr = (uint8_t*)new_cfg;
	uint32_t flash_ptr = CONFIG_FLASH_ADDR;
	uint32_t double_words_count = sizeof(RunnerConfig_t) / 8;

	HAL_FLASH_Unlock();
	__HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR | FLASH_FLAG_EOP | FLASH_FLAG_WRPERR | FLASH_FLAG_PGSERR);

	for (uint32_t i = 0; i < double_words_count; i++)
	{
		uint64_t double_word_to_write = 0;
		memcpy(&double_word_to_write, data_ptr + (i * 8), 8);
		HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, flash_ptr, double_word_to_write);
		flash_ptr += 8;
	}
	HAL_FLASH_Lock();

	APP_DBG("CONFIG: Nova konfigurace byla uspesne vypalena do Flash!");
}

// Tvrdé resetovací funkce (Vyvolané z BLE)
void Config_EraseAndReboot(void)
{
    APP_DBG(">>> BLE: Mazani Konfigurace a RESTART! <<<");
    EraseConfigPage();  // Smaže POUZE nultou stránku
    NVIC_SystemReset(); // Tvrdý hardwarový restart
}

void System_FactoryResetAll(void)
{
    APP_DBG(">>> BLE: Kompletni Factory Reset a RESTART! <<<");
    Logger_FormatAll(); // Smaže 159 stránek historie a nakrmí Watchdoga
    EraseConfigPage();  // Smaže nultou konfigurační stránku
    NVIC_SystemReset(); // Tvrdý hardwarový restart
}

bool Logger_IsRaceClosed(void) {
	return is_race_closed;
}

